// Похідний клас Книга
class Книга : ДрукарськеВидання
{
    public string Автор { get; set; }
    public int Тираж { get; set; }

    public Книга(string назва, double ціна, string автор, int тираж)
        : base(назва, ціна)
    {
        Автор = автор;
        Тираж = тираж;
    }

    // Перевизначені методи
    public override void ПоказатиДані()
    {
        base.ПоказатиДані();
        Console.WriteLine($"Автор: {Автор}, Тираж: {Тираж}");
    }

    // Власний метод класу з параметрами
    public void ПоказатиІнформацію(string назва, string автор)
    {
        Console.WriteLine($"Назва: {назва}, Автор: {автор}, Ціна: {Ціна}, Тираж: {Тираж}");
    }
}
